In [1]:
import mysql.connector

import datetime

import csv

import pandas as pd

from sqlalchemy import create_engine

import yfinance as yf

### connect to google cloud sql

In [2]:
import pymysql
connection = pymysql.connect(host='127.0.0.1',
                             user='root',
                             password='PApOEaPbJNOM62p1',
                             db='stockdb'
                            ,port=1234)

In [3]:
cur = connection.cursor()

### get the period of time we are interested in

In [8]:
now=datetime.date.today()
start = datetime.datetime(2020, 1, 1)
end = now

### read in the stock symbols from 500.csv

In [9]:
def companydata(file):
    companyfull=list()
    with open(file, newline='') as csvfile:
        reader = csv.DictReader(csvfile)
        #next(reader)
        for row in reader:
            companyfull.append(row)
    company=pd.DataFrame(companyfull)
    return company

In [10]:
company=companydata('500.csv')
companysymbol=company["Symbol"].tolist()
company1=company.drop(columns=['Name'])
Symbols=company['Symbol'].tolist()

In [41]:
company["new_name"] = company['Name'].str.replace("[']",'')

In [42]:
company

,Symbol,Name,Sector,new_name
0,MMM,3M Company,Industrials,3M Company
1,AOS,A.O. Smith Corp,Industrials,A.O. Smith Corp
2,ABT,Abbott Laboratories,Health Care,Abbott Laboratories
3,ABBV,AbbVie Inc.,Health Care,AbbVie Inc.
4,ABMD,ABIOMED Inc,Health Care,ABIOMED Inc
...,...,...,...,...
500,YUM,Yum! Brands Inc,Consumer Discretionary,Yum! Brands Inc
501,ZBRA,Zebra Technologies,Information Technology,Zebra Technologies
502,ZBH,Zimmer Biomet Holdings,Health Care,Zimmer Biomet Holdings
503,ZION,Zions Bancorp,Financials,Zions Bancorp
504,ZTS,Zoetis,Health Care,Zoetis

In [52]:
sqlcode1=('Select * From CompanyInformation')
cur.execute(sqlcode1)
test1 = cur.fetchone()
test1

('A', 'Agilent Technologies Inc', 'Health Care')

### insert data into google cloud sql, create table companyinformation

In [45]:
for row in company.iterrows():

    idx = row[0]
    symbol = row[1][0]
    name = row[1][3]
    sector = row[1][2]

    try: 
        cur.execute(f"INSERT INTO CompanyInformation (symbol,name,sector) VALUES ('{symbol}','{name}', '{sector}');")

    except Exception as e:
        print(e)
        continue

In [53]:
sqlcode1=('Select * From CompanyInformation Where Sector="Industrials"')
cur.execute(sqlcode1)
Industrials = cur.fetchone()
Industrials

('AAL', 'American Airlines Group', 'Industrials')

### create one table for each stock

In [12]:
for i in Symbols:
    symbol=yf.Ticker(i)
    df1 = symbol.history(start = start,end=end)
    df1['DATE']= pd.to_datetime(df1.index)
    try:
        cur.execute("CREATE TABLE "+i+"(date date,open varchar(250),high varchar(250),low varchar(250),close varchar(250),volume varchar(250),dividends varchar(250))")
        print('creating'+i)
        for row in df1.iterrows():
            date=row[1][7]
            open1 = row[1][0]
            high = row[1][1]
            low = row[1][2]
            close = row[1][3]
            volume = row[1][4]
            dividends=row[1][5]
            #cur.execute(f"INSERT INTO MMM (date,open,high,low,close,volume,dividends) VALUES ('{date}','{open1}','{high}','{low}','{close}','{volume}','{dividends}');")
            #f"(date,open,high,low,close,volume,dividends) VALUES ('{date}','{open1}','{high}','{low}','{close}','{volume}','{dividends}');"
            cur.execute(f"INSERT INTO "+ i +"(date,open,high,low,close,volume,dividends) VALUES "+f"('{date}','{open1}','{high}','{low}','{close}','{volume}','{dividends}');")
            
    except Exception as e:
        print(e)
        continue

(1050, "Table 'MMM' already exists")
(1050, "Table 'AOS' already exists")
(1050, "Table 'ABT' already exists")
(1050, "Table 'ABBV' already exists")
(1050, "Table 'ABMD' already exists")
(1050, "Table 'ACN' already exists")
(1050, "Table 'ATVI' already exists")
(1050, "Table 'ADBE' already exists")
(1050, "Table 'AAP' already exists")
(1050, "Table 'AMD' already exists")
(1050, "Table 'AES' already exists")
(1050, "Table 'AFL' already exists")
(1050, "Table 'A' already exists")
(1050, "Table 'APD' already exists")
(1050, "Table 'AKAM' already exists")
(1050, "Table 'ALK' already exists")
(1050, "Table 'ALB' already exists")
(1050, "Table 'ARE' already exists")
(1050, "Table 'ALXN' already exists")
(1050, "Table 'ALGN' already exists")
(1050, "Table 'ALLE' already exists")
(1050, "Table 'LNT' already exists")
(1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'ALL(date date,open varchar(250),high varchar(250),low varchar(250),close varchar' at line 1")
(1050, "Table 'GOOGL' already exists")
(1050, "Table 'GOOG' already exists")
(1050, "Table 'MO' already exists")
(1050, "Table 'AMZN' already exists")
(1050, "Table 'AMCR' already exists")
(1050, "Table 'AEE' already exists")
(1050, "Table 'AAL' already exists")
(1050, "Table 'AEP' already exists")
(1050, "Table 'AXP' already exists")
(1050, "Table 'AIG' already exists")
(1050, "Table 'AMT' already exists")
(1050, "Table 'AWK' already exists")
(1050, "Table 'AMP' already exists")
(1050, "Table 'ABC' already exists")
(1050, "Table 'AME' already exists")
(1050, "Table 'AMGN' already exists")
(1050, "Table 'APH' already exists")
(1050, "Table 'ADI' already exists")
(1050, "Table 'ANSS' already exists")
(1050, "Table 'ANTM' already exists")
(1050, "Table 'AON' already exists")
(1050, "Table 'APA' already exists")
(1050, "Table 'AIV' already exists")
(1050, "Table 'AAPL' already exists")
(1050, "Table 'AMAT' already exists")
(1050, "Table 'APTV' already exists")
(1050, "Table 'ADM' already exists")
(1050, "Table 'ANET' already exists")
(1050, "Table 'AJG' already exists")
(1050, "Table 'AIZ' already exists")
(1050, "Table 'T' already exists")
(1050, "Table 'ATO' already exists")
(1050, "Table 'ADSK' already exists")
(1050, "Table 'ADP' already exists")
(1050, "Table 'AZO' already exists")
(1050, "Table 'AVB' already exists")
(1050, "Table 'AVY' already exists")
(1050, "Table 'BKR' already exists")
(1050, "Table 'BLL' already exists")
(1050, "Table 'BAC' already exists")
(1050, "Table 'BAX' already exists")
(1050, "Table 'BDX' already exists")
- BRK.B: No data found, symbol may be delisted
(1049, "Unknown database 'BRK'")
(1050, "Table 'BBY' already exists")
(1050, "Table 'BIO' already exists")
(1050, "Table 'BIIB' already exists")
(1050, "Table 'BLK' already exists")
(1050, "Table 'BA' already exists")
(1050, "Table 'BKNG' already exists")
(1050, "Table 'BWA' already exists")
(1050, "Table 'BXP' already exists")
(1050, "Table 'BSX' already exists")
(1050, "Table 'BMY' already exists")
(1050, "Table 'AVGO' already exists")
(1050, "Table 'BR' already exists")
- BF.B: No data found for this date range, symbol may be delisted
(1049, "Unknown database 'BF'")
(1050, "Table 'CHRW' already exists")
(1050, "Table 'COG' already exists")
(1050, "Table 'CDNS' already exists")
(1050, "Table 'CPB' already exists")
(1050, "Table 'COF' already exists")
(1050, "Table 'CAH' already exists")
(1050, "Table 'KMX' already exists")
(1050, "Table 'CCL' already exists")
(1050, "Table 'CARR' already exists")
(1050, "Table 'CAT' already exists")
(1050, "Table 'CBOE' already exists")
(1050, "Table 'CBRE' already exists")
(1050, "Table 'CDW' already exists")
(1050, "Table 'CE' already exists")
(1050, "Table 'CNC' already exists")
(1050, "Table 'CNP' already exists")
(1050, "Table 'CTL' already exists")
(1050, "Table 'CERN' already exists")
(1050, "Table 'CF' already exists")
(1050, "Table 'SCHW' already exists")
(1050, "Table 'CHTR' already exists")
(1050, "Table 'CVX' already exists")
(1050, "Table 'CMG' already exists")
(1050, "Table 'CB' already exists")
(1050, "Table 'CHD' already exists")
(1050, "Table 'CI' already exists")
(1050, "Table 'CINF' already exists")
(1050, "Table 'CTAS' already exists")
(1050, "Table 'CSCO' already exists")
(1050, "Table 'C' already exists")
(1050, "Table 'CFG' already exists")
(1050, "Table 'CTXS' already exists")
(1050, "Table 'CME' already exists")
(1050, "Table 'CMS' already exists")
(1050, "Table 'KO' already exists")
(1050, "Table 'CTSH' already exists")
(1050, "Table 'CL' already exists")
(1050, "Table 'CMCSA' already exists")
(1050, "Table 'CMA' already exists")
(1050, "Table 'CAG' already exists")
(1050, "Table 'CXO' already exists")
(1050, "Table 'COP' already exists")
(1050, "Table 'ED' already exists")
(1050, "Table 'STZ' already exists")
(1050, "Table 'CPRT' already exists")
(1050, "Table 'GLW' already exists")
(1050, "Table 'CTVA' already exists")
(1050, "Table 'COST' already exists")
(1050, "Table 'COTY' already exists")
(1050, "Table 'CCI' already exists")
(1050, "Table 'CSX' already exists")
(1050, "Table 'CMI' already exists")
(1050, "Table 'CVS' already exists")
(1050, "Table 'DHI' already exists")
(1050, "Table 'DHR' already exists")
(1050, "Table 'DRI' already exists")
(1050, "Table 'DVA' already exists")
(1050, "Table 'DE' already exists")
(1050, "Table 'DAL' already exists")
(1050, "Table 'XRAY' already exists")
(1050, "Table 'DVN' already exists")
(1050, "Table 'DXCM' already exists")
(1050, "Table 'FANG' already exists")
creatingDLR
creatingDFS
creatingDISCA
creatingDISCK
creatingDISH
creatingDG
creatingDLTR
creatingD
creatingDPZ
creatingDOV
creatingDOW
creatingDTE
creatingDUK
creatingDRE
creatingDD
creatingDXC
creatingETFC
creatingEMN
creatingETN
creatingEBAY
creatingECL
creatingEIX
creatingEW
creatingEA
creatingEMR
creatingETR
creatingEOG
creatingEFX
creatingEQIX
creatingEQR
creatingESS
creatingEL
creatingRE
creatingEVRG
creatingES
creatingEXC
creatingEXPE
creatingEXPD
creatingEXR
creatingXOM
creatingFFIV
creatingFB
creatingFAST
creatingFRT
creatingFDX
creatingFIS
creatingFITB
creatingFRC
creatingFE
creatingFISV
creatingFLT
creatingFLIR
creatingFLS
creatingFMC
creatingF
creatingFTNT
creatingFTV
creatingFBHS
creatingFOXA
creatingFOX
creatingBEN
creatingFCX
creatingGPS
creatingGRMN
creatingIT
creatingGD
creatingGE
creatingGIS
creatingGM
creatingGPC
creatingGILD
creatingGPN
creatingGL
creatingGS
creatingGWW
creatingHRB
creatingHAL
creatingHBI
creatingHIG
creatingHAS
creatingHCA
creatingPEAK
creatingHSIC
creatingHES
creatingHPE
creatingHLT
creatingHFC
creatingHOLX
creatingHD
creatingHON
creatingHRL
creatingHST
creatingHWM
creatingHPQ
creatingHUM
creatingHBAN
creatingHII
creatingIEX
creatingIDXX
creatingINFO
creatingITW
creatingILMN
creatingINCY
creatingIR
creatingINTC
creatingICE
creatingIBM
creatingIFF
creatingIP
creatingIPG
creatingINTU
creatingISRG
creatingIVZ
creatingIPGP
creatingIQV
creatingIRM
creatingJBHT
creatingJKHY
creatingJ
creatingSJM
creatingJNJ
creatingJCI
creatingJPM
creatingJNPR
creatingKSU
creatingK
(1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'KEY(date date,open varchar(250),high varchar(250),low varchar(250),close varchar' at line 1")
(1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'KEYS(date date,open varchar(250),high varchar(250),low varchar(250),close varcha' at line 1")
creatingKMB
creatingKIM
creatingKMI
creatingKLAC
creatingKSS
creatingKHC
creatingKR
creatingLB
creatingLHX
creatingLH
creatingLRCX
creatingLW
creatingLVS
creatingLEG
creatingLDOS
creatingLEN
creatingLLY
creatingLNC
creatingLIN
creatingLYV
creatingLKQ
creatingLMT
creatingL
creatingLOW
creatingLYB
creatingMTB
creatingMRO
creatingMPC
creatingMKTX
creatingMAR
creatingMMC
creatingMLM
creatingMAS
creatingMA
creatingMXIM
creatingMKC
creatingMCD
creatingMCK
creatingMDT
creatingMRK
creatingMET
creatingMTD
creatingMGM
creatingMCHP
creatingMU
creatingMSFT
creatingMAA
creatingMHK
creatingTAP
creatingMDLZ
creatingMNST

creatingMCO
creatingMS
creatingMSI
creatingMSCI
creatingMYL
creatingNDAQ
creatingNOV
creatingNTAP
creatingNFLX
creatingNWL
creatingNEM
creatingNWSA
creatingNWS
creatingNEE
creatingNLSN
creatingNKE
creatingNI
creatingNBL
creatingNSC
creatingNTRS
creatingNOC
creatingNLOK
creatingNCLH
creatingNRG
creatingNUE
creatingNVDA
creatingNVR
creatingORLY
creatingOXY
creatingODFL
creatingOMC
creatingOKE
creatingORCL
creatingOTIS
creatingPCAR
creatingPKG
creatingPH
creatingPAYX
creatingPAYC
creatingPYPL
creatingPNR
creatingPBCT
creatingPEP
creatingPKI
creatingPRGO
creatingPFE
creatingPM
creatingPSX
creatingPNW
creatingPXD
creatingPNC
creatingPPG
creatingPPL
creatingPFG
creatingPG
creatingPGR
creatingPLD
creatingPRU
creatingPEG
creatingPSA
creatingPHM
creatingPVH
creatingQRVO
creatingQCOM
creatingPWR
creatingDGX
creatingRL
creatingRJF
creatingRTX
creatingO
creatingREG
creatingREGN
creatingRF
creatingRSG
creatingRMD
creatingRHI
creatingROK
creatingROL
creatingROP
creatingROST
creatingRCL
creatingSPGI
creatingCRM
creatingSBAC
creatingSLB
creatingSTX
creatingSEE
creatingSRE
(1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'NOW(date date,open varchar(250),high varchar(250),low varchar(250),close varchar' at line 1")
creatingSHW
creatingSPG
creatingSWKS
creatingSLG
creatingSNA
creatingSO
creatingLUV
creatingSWK
creatingSBUX
creatingSTT
creatingSTE
creatingSYK
creatingSIVB
creatingSYF
creatingSNPS
creatingSYY
creatingTMUS
creatingTROW
creatingTTWO
creatingTPR
creatingTGT
creatingTEL
creatingFTI
creatingTDY
creatingTFX
creatingTXN
creatingTXT
creatingBK
creatingCLX
creatingCOO
creatingHSY
creatingMOS
creatingTRV
creatingDIS
creatingTMO
creatingTIF
creatingTJX
creatingTSCO
creatingTT
creatingTDG
creatingTFC
creatingTWTR
creatingTYL
creatingTSN
creatingUSB
creatingUDR
creatingULTA
creatingUAA
creatingUA
creatingUNP
creatingUAL
creatingUNH
creatingUPS
creatingURI
creatingUHS
creatingUNM
creatingVLO
creatingVAR
creatingVTR
creatingVRSN
creatingVRSK
creatingVZ
creatingVRTX
creatingVFC
creatingVIAC
creatingV
creatingVNO
creatingVMC
creatingWRB
creatingWAB
creatingWBA
creatingWMT
creatingWM
creatingWAT
creatingWEC
creatingWFC
creatingWELL
creatingWST
creatingWDC
creatingWU
creatingWRK
creatingWY
creatingWHR
creatingWMB
creatingWLTW
creatingWYNN
creatingXEL
creatingXRX
creatingXLNX
creatingXYL
creatingYUM
creatingZBRA
creatingZBH
creatingZION
creatingZTS

In [239]:
sqlcode1=('Select * From A')
cur.execute(sqlcode1)
Industrials = cur.fetchone()
Industrials

(datetime.date(2020, 1, 2), '85.35', '85.8', '84.65', '85.4', '1410500', '0.0')